# Question 1

In [5]:
import pandas as pd

In [6]:
data = {
    'name': ['Andy', 'Jose', 'Dieu', 'Chloe', 'Jose'],
    'continent': ['America', 'Europe', 'Asia', 'America', 'Europe'],
    'college': ['Lib Arts', 'Business', 'Engineering', 'Engineering', 'Business']
}

In [7]:
students_df = pd.DataFrame(data)
students_df.head(5)

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering
4   Jose    Europe     Business

### A) Write R or Pandas code to de-dup STUDENTS:

In [11]:
students_df = students_df.drop_duplicates()
students_df.head(5)

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering

### B) Create a data frame COUNTS storing the count of students for each continent, college pair

In [16]:
counts_df = (
    students_df.groupby(['continent', 'college'])
    .size()
    .unstack(fill_value=0)
)
counts_df.head(5)

college    Business  Engineering  Lib Arts
continent
America           0            1         1
Asia              0            1         0
Europe            1            0         0

### C) Pivot COUNTS so that continent values become column names (2pts)

In [39]:
counts_df = counts_df.pivot_table(counts_df, columns="continent")
counts_df.head(5)

continent    America  Asia  Europe
college
Business           0     0       1
Engineering        1     1       0
Lib Arts           1     0       0

### D) If applicable, remove any unnecessary index levels created in part C (1pts):

In [40]:
#not applicable

### E) Zero-fill missing values in COUNTS

In [43]:
counts_df = counts_df.fillna(0).astype(int)
counts_df.head()

continent    America  Asia  Europe
college
Lib Arts           1     0       0
Engineering        1     1       0
Business           0     0       1

### F) Sort COUNTS reverse alphabetically by college name

In [44]:
counts_df.sort_index(ascending=False, inplace=True)
counts_df.head(5)

continent    America  Asia  Europe
college
Lib Arts           1     0       0
Engineering        1     1       0
Business           0     0       1

# Question 2

In [ ]:
#highlighted in the word document